using System;
using System.Collections.Generic;
using System.Text;

namespace Base_Lessons
{
    class Arrays
    {
        /*
         Мәзір
            
            #1 Бір өлшемді Тізбектер (arrays)
                #1.1 Мысал 1 - Кілт-сандар және әдепкі мәні
                #1.2 Мысал 2 - Тізбектерге мән тағайындау
                #1.3 Мысал 3 - Бірден мәнің тағайындаса болады
                #1.4 Мысал 4 - for арқылы мән тағайындау
                #1.5 Мысал 5 - String түріндегі дерек қорымен Array(Тізбекке) мән тағайындау
         
         */



        //#1 Бір өлшемді Тізбектер (arrays)

        public static void InfoArrays()
        {

            // Қазақ әріптерін дұрыс шығару үшін қажет
            Console.OutputEncoding = Encoding.UTF8;

            Console.WriteLine("");
            Console.WriteLine("#1 Тізбектер (arrays)"); //


            //#1.1 Мысал 1 - Кілт-сандар және әдепкі мәні

            // Тізбектерді құру
            int[] numbers;
            // Тізбектерге Жадтан орын алу
            //Қанша орын кереген көрсету біз 10 орын көрсеттік әр орынға жеке-жеке сандарды салу үшің
            numbers = new int[10]; // тізбектегі әдіпкі мәні 0-ге тең

            Console.WriteLine("");
            Console.WriteLine("Мысал 1 - Кілт-сандар және әдепкі мәні"); //

            // Тізбектердін мәнің оқу үшін бір цикл(ілмек) керек  біз for ілмегін пайдаланып тізбектің мәнің оқимыз
            // .Length - деген өзіңдік қасиеті бар - ол тізбекте неше орын бар  соны аңықтайды және бізге қайтарады қазіргі жағдайда 10 қайтарады 
            // Тізбектің ұзындығын өзіміз көрсетсекте болады алайда кей жағдайда біз оны білмеуіміз мүмкін немесе әр-дайым ол өзгеріп отыруы мүмкін
            for (int i = 0;i < numbers.Length; i++) //Осы жерде осылай жазылған (int i = 0; i < 10; i++)
            {
                //Тізбектін мәнің шығару 
                // Тізбектің әр мәніңде кілт-сан болады
                // Кілт-сандар 0(нөл)-ден басталады - 10 орын болса 9-кілт-сан болады мысалы: 0,1,2,3,4,5,6,7,8,9 нөлді қосқанда 10орын-10кілт-сан болады
                // Кілт-сандар тізбектін қай мәнің шығару керегін аңықтау үшін қажет

                Console.WriteLine("Кілт-сан: " + i + " = Мәні: " + numbers[i] + " - Әдепкі мәні"); // Қазір бәрінде әдепкі мәні шықты себебі біз әлі мән тағайындаған жоқпыз
            }



            // #1.2 Мысал 2 - Тізбектерге мән тағайындау

            // Тізбектерді құру
            int[] numbers2;
            // Тізбектерге Жадтан орын алу
            //Қанша орын кереген көрсету біз 5 орын көрсеттік әр орынға жеке-жеке сандарды салу үшің
            numbers2 = new int[5]; // тізбектегі әдіпкі мәні 0-ге тең

            // Қай орынға мән тағайындау керегің кілт-санны арқылы аңықтау
            // мысал:
            numbers2[0] = 18; // кілт-сан: 0 = мәнің: 18 тағайындадық
            numbers2[1] = 55; // кілт-сан: 1 = мәнің: 55 тағайындадық
            numbers2[4] = 99; // кілт-сан: 4 = мәнің: 99 тағайындадық
            // Ал мәні тағайындалмаған орындарда әдепкі нөл мәні тағайындалады

            Console.WriteLine("");
            Console.WriteLine("Мысал 2 - Тізбектерге мән тағайындау"); //

            for (int i = 0; i < numbers2.Length; i++)
            {
                //Тізбектін мәнің шығару 
                // Тізбектің әр мәніңде кілт-сан болады
                // Кілт-сандар 0(нөл)-ден басталады - 5 орын болса 5-кілт-сан болады мысалы: 0,1,2,3,4 нөлді қосқанда 5орын-5кілт-сан болады
                // Кілт-сандар тізбектін қай мәнің шығару керегін аңықтау үшін қажет

                Console.WriteLine("Кілт-сан: " + i + " = Мәні: " + numbers2[i] + (numbers2[i] == 0? " - Әдепкі мәні":" - Тағайындалған мәні")); // тағайындалмаған орындарда әдепкі нөл мәні тағайындалды
            }



            // #1.3 Мысал 3 - Бірден мәнің тағайындаса болады

            // Тізбектерді құру
            int[] numbers3;
            // Тізбектерге Жадтан орын алу
            //Қанша орын кереген көрсету біз 10 орын көрсеттік әр орынға жеке-жеке сандарды салу үшің
            // Бірден мәнің тағайындаймыз
            // Бірден мәнің тағайындағанда ---ЕСКЕРЕТІН--- бір жағдай - қанша орын көрсетсек соның бәріне мән тағайындау қажет
            numbers3 = new int[10] {10,22,33,44,55,66,77,88,99,111}; // тізбектегі әдіпкі мәні 0-ге тең


            Console.WriteLine("");
            Console.WriteLine("Мысал 3 - Бірден мәнің тағайындаса болады"); 

            for (int i = 0; i < numbers3.Length; i++)
            {
                //Тізбектін мәнің шығару 
                // Тізбектің әр мәніңде кілт-сан болады
                // Кілт-сандар 0(нөл)-ден басталады - 10 орын болса 10-кілт-сан болады мысалы: 0,1,2,3,4,5,6,7,8,9 нөлді қосқанда 10орын-10кілт-сан болады
                // Кілт-сандар тізбектін қай мәнің шығару керегін аңықтау үшін қажет

                Console.WriteLine("Кілт-сан: " + i + " = Мәні: " + numbers3[i]); // тағайындалмаған орындарда әдепкі нөл мәні тағайындалды
            }


            // #1.4 Мысал 4 - for арқылы мән тағайындау
            Console.WriteLine("");
            Console.WriteLine("Мысал 4 - for арқылы мән тағайындау");

            //for арқылы мән тағайындағанда сөзсіз жаңа орын алуымыз керек - олай болмаған жағдайда қате шығады
            int[] arr = new int[8];

            //for арқылы мән тағайындау
            for(int i = 0; i < arr.Length; i++)
            {
                //Мән тағайындау
                arr[i] = i + 2; // әр кілт-санға 2-ден қосып бердік
                Console.WriteLine("Тағайындалған мәні: "+arr[i] + " - "+i +" + "+ 2 + " = " + (i + 2));
            }


            // #1.5 Мысал 5 - String түріндегі дерек қорымен Array(Тізбекке) мән тағайындау
            Console.WriteLine("");
            Console.WriteLine("Мысал 5 - String түріндегі дерек қорымен Array(Тізбекке) мән тағайындау");


            /*
             Егер біз ойын ойнатсақ 
            Ойын - бір адамға сыйлық бермек болсақ
            6 адам қаттысса оның тек 1адамына ғана сыйлық бермек болсақ кейдесоқ түсетін сандар арқылы аңықтауға болады
            ал 6 адамның Есімдерін бір тізбекке жинап аламыз сосын сол тізбектегі кілт-сандар арқылы Есімін аңықтаймыз
            Мысал:
            */
            //Байқасаңыз мен қанша орын керегін көрсетпедім 
            // Қанша орын керегін көрсетпеген жағдайда сіз бастапқыда қанша орынға мән берсеніз сонша орын қажет деп ойлайды
            // Қазіргі жағдайда 6 орын керек деп ойлайды
            string[] names = new string[] { "Арыстан", "Ержан", "Нұрбол", "Айтан", "Мұрат", "Тілек" };
            /*
             Кейдейсоқ санды қалай аңықтаймыз десеңіз системаның бізге дайындап қойған әдісі бар ол Random() деп аталады
            Random() пайдалану келесідей
             */
            Random random = new Random();

            // Кейдейсоқ түскен санды бір айнымалыға сақтап аламыз біздін жағдайда айдымалы аты index
            // random.Next(min, max); - деген кейдесоқ түсетін сандардын басталуы мен аяқталуын аңықтау үшін керек 
            //біздін жағдайда басталуы 0(нөл) аяқталуы тізімге байланысты ал тізімде 6(нөлді қоспағанда)
            // Енді неге тізімнің ұзындығынаң 1-ді(names.Length - 1) алып тастадық десеңіз біз 0(нөл)-ді қостық нөлді қосып есептесек 6 емес 5 болады
            // нөлді қосқанда 1сан артық болады сол артық санды алып тастадық names.Length - 1 осылай
            int index = random.Next(0, names.Length - 1);

            // Тізімнең Есімді шығару үшін кейдесоқ түскен санды сақтаған айнымалыны пайдаланыамыз келесіндей - Әр қосылғанда есім өзгеріп отырады
            Console.WriteLine("Есімі: " + names[index] + " - " + "Кейдесоқ түскен сан: " + index);
        }

    }
}
